Pixelect/app/controllers/comments_controller.rb

  def index
    @comments = Tournament.find(params[:tournament_id]).comments
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT 1  [["id", 85]]
SELECT "comments".* FROM "comments" WHERE "comments"."tournament_id" = $1  [["tournament_id", 85]]

  def create
    @comment = Tournament.find(params[:tournament_id]).comments.new(new_comment_params)
    if @comment.save
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT 1  [["id", 87]]
INSERT INTO "comments" ("body", "tournament_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "body"], ["tournament_id", 87], ["user_id", 95], ["created_at", "2015-03-12 20:10:55.320359"], ["updated_at", "2015-03-12 20:10:55.320359"]]

  def update
    @comment = Comment.find(params[:id])
    if @comment.update(edit_comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 51]]
UPDATE "comments" SET "subcomment" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["subcomment", "some text"], ["updated_at", "2015-03-12 20:10:55.351654"], ["id", 51]]