app/controllers/tournaments_controller.rb

  def index
    if params[:user_id]
      @tournaments = User.find(params[:user_id]).tournaments
    else
      @tournaments = Tournament.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 27]]
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."user_id" = $1  [["user_id", 27]]
SELECT "tournaments".* FROM "tournaments"

  def show
    @tournament = Tournament.find(params[:id])
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT 1  [["id", 36]]

  def create
    @tournament = Tournament.new(new_tournament_params)

    if @tournament.save
---
INSERT INTO "tournaments" ("question", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["question", "which color is warmer?"], ["user_id", 29], ["created_at", "2015-03-12 22:21:05.225762"], ["updated_at", "2015-03-12 22:21:05.225762"]]

  def update
    @tournament = Tournament.find(params[:id])
    if checkStatus(@tournament) && @tournament.update(edit_tournament_params)
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT 1  [["id", 34]]
UPDATE "tournaments" SET "email_list" = $1, "updated_at" = $2 WHERE "tournaments"."id" = $3  [["email_list", "a@a.com"], ["updated_at", "2015-03-12 22:21:05.253668"], ["id", 34]]